ybaransky/esp8266-clock/src/file_api.h
#pragma once

#include <Arduino.h>
#include <ESP8266WebServer.h>
#include <LittleFS.h>

#include "http_responder.h"

// Handles LittleFS listing, reading, deletion, and streamed-upload HTTP endpoints.
class FileApi {
 public:
  FileApi(ESP8266WebServer& server, HttpResponder& responder)
      : server_(server), responder_(responder) {}

  void handleListFiles();
  void handleReadFile();
  void handleDeleteFile();
  void handleUpload();
  void handleUploadData();

 private:
  static const char* mimeTypeForPath(const String& path);
  static String normalizedFilePath(const String& requestedName);
  static String uploadFilePath(const String& uploadName);
  static void sendJsonEscapedString(ESP8266WebServer& server, const String& value);

  void closeUploadFile();
  // Mirrors the byte range just served to the serial monitor, but only for
  // the config file - every other path returns immediately. Call it after the
  // response has been sent: serial runs at roughly 7.5 KB/s, so this is far
  // slower than the HTTP transfer and must not sit on the browser's wait. The
  // per-chunk yield() keeps the watchdog fed and the display alive.
  static void logFileContent(File& file, const String& path, size_t offset,
                             size_t length);

  ESP8266WebServer& server_;  // Source of file-management requests.
  HttpResponder& responder_;  // Sends file-management responses.
  File uploadFile_;           // Active upload destination file.
  bool uploadError_ = false;  // True after an upload write/open failure.
};
